---
type: RebarShapeParameters
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 7
tags: [revit-api, class]
---

# RebarShapeParameters

`Autodesk.Revit.DB.Structure.RebarShapeParameters` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetAllRebarShapeParameters | 2012 | `public static IList < ElementId > GetAllRebarShapeParameters ( Document doc )` |
| Method | GetElementIdForExternalDefinition | — | `public static ElementId GetElementIdForExternalDefinition ( Document doc , ExternalDefinition externalDefinition )` |
| Method | GetExternalDefinitionForElementId | — | `public static ExternalDefinition GetExternalDefinitionForElementId ( Document doc , ElementId paramId , DefinitionFile definitionFile )` |
| Method | GetOrCreateElementIdForExternalDefinition | — | `public static ElementId GetOrCreateElementIdForExternalDefinition ( Document doc , ExternalDefinition externalDefinition )` |
| Method | IsValidExternalDefinition | 2012 | `public static bool IsValidExternalDefinition ( ExternalDefinition param )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |